syabyr/stm8_proj/new_air/newair-/src/main.c
/**
  ******************************************************************************
  * @file UART1_Printf\main.c
  * @brief This file contains the main function for: retarget the C library printf
  *        /scanf functions to the UART1 example.
  * @author  MCD Application Team
  * @version  V2.2.0
  * @date     30-September-2014
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "stdio.h"
#include "main.h"
/**
  * @addtogroup UART1_Printf
  * @{
  */
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#ifdef _RAISONANCE_
  #define PUTCHAR_PROTOTYPE int putchar (char c)
  #define GETCHAR_PROTOTYPE int getchar (void)
#elif defined (_COSMIC_)
  #define PUTCHAR_PROTOTYPE char putchar (char c)
  #define GETCHAR_PROTOTYPE char getchar (void)
#elif defined (_SDCC_)         /* SDCC patch: ensure same types as stdio.h */
  #if SDCC_VERSION >= 30605      // declaration changed in sdcc 3.6.5 (officially with 3.7.0)
    #define PUTCHAR_PROTOTYPE int putchar(int c)
    #define GETCHAR_PROTOTYPE int getchar(void)
  #else
    #define PUTCHAR_PROTOTYPE void putchar(char c)
    #define GETCHAR_PROTOTYPE int getchar(void)
  #endif 
#else /* _IAR_ */
  #define PUTCHAR_PROTOTYPE int putchar (int c)
  #define GETCHAR_PROTOTYPE int getchar (void)
#endif /* _RAISONANCE_ */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

extern int16_t nCounter;
extern int16_t speed_counter;
/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
void main(void)
{
  //char ans;
  /*High speed internal clock prescaler: 1*/
  CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);

  GPIO_Config();  

  /* Initialize the Interrupt sensitivity */
  //key
  EXTI_SetExtIntSensitivity(EXTI_PORT_GPIOC, EXTI_SENSITIVITY_RISE_FALL);
  //ir
  EXTI_SetExtIntSensitivity(EXTI_PORT_GPIOD, EXTI_SENSITIVITY_FALL_ONLY);
  EXTI_SetTLISensitivity(EXTI_TLISENSITIVITY_FALL_ONLY);
  


  GPIO_WriteReverse(LED_PORT, LED_PIN);

  UART2_Config();
  TIM1_Config();
  TIM2_Config();
  TIM3_Config();
  TIM4_Config();

  fan_init();

  enableInterrupts();
  


  while (1)
  {
      if ((GPIO_ReadInputData(FAN_SENSE_PORT) & FAN_SENSE_PIN) == 0x00)
      {
          GPIO_WriteLow(LED_PORT,LED_PIN);
      }
      else
      {
          GPIO_WriteHigh(LED_PORT,LED_PIN);
      }
      /*
      if(nCounter > 500)
      {
          nCounter = 0;
          printf("t4:%d\r\n",speed_counter);
      }
       */

  }
}


static void GPIO_Config(void)
{
  /* Initialize I/Os in Output Mode for RED LED */
  GPIO_Init(LED_PORT, (GPIO_Pin_TypeDef)(LED_PIN),GPIO_MODE_OUT_PP_HIGH_FAST);

  /* Initialize I/O in Input Mode with Interrupt for KEY */
  GPIO_Init(KEY_PORT, (GPIO_Pin_TypeDef)(KEY_PIN),GPIO_MODE_IN_FL_IT);

  /* Initialize I/O in Input Mode for IR */
  GPIO_Init(IR_PORT, (GPIO_Pin_TypeDef)(IR_PIN),GPIO_MODE_IN_FL_NO_IT);

  /* Initialize I/O in Input Mode for FAN Sense */
  GPIO_Init(FAN_SENSE_PORT,(GPIO_Pin_TypeDef)(FAN_SENSE_PIN),GPIO_MODE_IN_FL_NO_IT);

  /* Initialize I/Os in Output Mode for FAN SW */
  GPIO_Init(FAN_PORT, (GPIO_Pin_TypeDef)(FAN_SW_PIN),GPIO_MODE_OUT_PP_HIGH_FAST);
  
}


void UART2_Config(void)
{
    UART2_DeInit();
    /* UART1 configuration ------------------------------------------------------*/
    /* UART1 configured as follow:
          - BaudRate = 115200 baud
          - Word Length = 8 Bits
          - One Stop Bit
          - No parity
          - Receive and transmit enabled
          - UART1 Clock disabled
    */
    UART2_Init((uint32_t)115200, UART2_WORDLENGTH_8D, UART2_STOPBITS_1, UART2_PARITY_NO,
               UART2_SYNCMODE_CLOCK_DISABLE, UART2_MODE_TXRX_ENABLE);

    /* Output a message on Hyperterminal using printf function */
    printf("\n\rfan start\n\r");
}


/*风扇控制pwm 初始化*/
void TIM1_Config(void)
{
    TIM1_DeInit();

    TIM1_TimeBaseInit(0, TIM1_COUNTERMODE_UP, 3200, 0);

    TIM1_OC1Init(TIM1_OCMODE_PWM2, TIM1_OUTPUTSTATE_ENABLE, TIM1_OUTPUTNSTATE_ENABLE,
                 3100, TIM1_OCPOLARITY_LOW, TIM1_OCNPOLARITY_HIGH, TIM1_OCIDLESTATE_SET,
                 TIM1_OCNIDLESTATE_RESET);
    TIM1_Cmd(ENABLE);
    TIM1_CtrlPWMOutputs(ENABLE);
}

/*风扇测速 初始化*/
void TIM2_Config(void)
{
    //16分频,60ms溢出
    TIM2_TimeBaseInit(TIM2_PRESCALER_16,60000-1);
    TIM2_ICInit( TIM2_CHANNEL_1, TIM2_ICPOLARITY_FALLING, TIM2_ICSELECTION_DIRECTTI,
                 TIM2_ICPSC_DIV1, 0x0);
    TIM2_ClearFlag(TIM2_FLAG_CC1);
    TIM2_ITConfig(TIM2_IT_UPDATE,ENABLE);
    TIM2_ITConfig(TIM2_IT_CC1,ENABLE);
    TIM2_Cmd(ENABLE);

}

/*IR 捕获 初始化*/
void TIM3_Config(void)
{
    TIM3_TimeBaseInit(TIM3_PRESCALER_16,60000-1);
    //通道1,下降沿生效,
    TIM3_ICInit( TIM3_CHANNEL_1, TIM3_ICPOLARITY_FALLING, TIM3_ICSELECTION_DIRECTTI,
                 TIM3_ICPSC_DIV1, 0x0);

    TIM3_ClearFlag(TIM3_FLAG_CC1);
    TIM3_ITConfig(TIM3_IT_UPDATE,ENABLE);
    TIM3_ITConfig(TIM3_IT_CC1,ENABLE);
    TIM3_Cmd(ENABLE);
}

/* 定时任务处理*/
void TIM4_Config(void)
{
    TIM4_TimeBaseInit(TIM4_PRESCALER_128,250-1);  //2ms中断一次
    TIM4_ClearFlag(TIM4_FLAG_UPDATE);
    TIM4_ITConfig(TIM4_IT_UPDATE,ENABLE);
    TIM4_Cmd(ENABLE);
}

void IWDG_Config(void)
{
    IWDG_Enable();
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
    IWDG_SetPrescaler(IWDG_Prescaler_128);
    //__IO uint32_t LsiFreq = LSIMeasurment();
    //IWDG_SetReload((uint8_t)(LsiFreq/512));
    IWDG_SetReload(255);
    IWDG_ReloadCounter();
}

/**
  * @brief Retargets the C library printf function to the UART.
  * @param c Character to send
  * @retval char Character sent
  */
PUTCHAR_PROTOTYPE
{
  /* Write a character to the UART1 */
  UART2_SendData8(c);
  /* Loop until the end of transmission */
  while (UART2_GetFlagStatus(UART2_FLAG_TXE) == RESET);

  return (c);

}

/**
  * @brief Retargets the C library scanf function to the USART.
  * @param None
  * @retval char Character to Read
  */
GETCHAR_PROTOTYPE
{
#ifdef _COSMIC_
  char c = 0;
#else
  int c = 0;
#endif
  /* Loop until the Read data register flag is SET */
  while (UART2_GetFlagStatus(UART2_FLAG_RXNE) == RESET);
    c = UART2_ReceiveData8();
  return (c);
}


/**
  * @}
  */


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
